<?php

/**
 * 错误代码
 *
 * 对应返回代码->显示的文字
 *
 * 更新
 *  2015-09-11 15:19:04 Calvin 创建
 *  2015-10-09 15:56:48 Calvin 更新1.1版本的错误代码
 */
return [

    '1001' => '参数不完整',
    '1002' => '主要参数至少有一个',
    '2001' => "稿件不存在",
    '3001' => "禁用弹幕",
    '4001' => "该手机号已经被注册",
    '4002' => "手机号或密码错误",
    '4003' => "登录方式错误",
    '4004' => "手机号不存在",
    '4005' => "这个账户不存在手机注册方式",
    '4006' => "原密码错误",
    '4007' => "修改密码失败",
    '4008' => "性别填写错误",
    '5001' => "用户资料修改失败",
    '6001' => "稿件信息不存在",
    '6002' => "商品信息不存在",
    '6003' => "评论信息不存在",
    '6005' => "当前商品已经被加入心愿清单",
    '6004' => "评论不属于当前用户",
    '6006' => "心愿清单不存在",
    '6007' => "分类不存在",
    '7001' => "当前用户已经认证",
    '7002' => "当前用户没有认证",
    '7003' => "签到失败",
    '7004' => '没有这个验证码',
    '7005' => "验证码已经使用了",
    '7006' => "话题不存在",
    '7007' => "标签数量超出限制",
    '7008' => "这个用户不存在",
    '7009' => "内容不存在",
    '7010' => "已经点赞",
    '7011' => "没有点赞",
    '7012' => "标签不存在",
    '7013' => "这个内容下的这个标签不存在",
    '7014' => "这个内容不属于这个用户",
    '7015' => "今天已经签到",
    '9001' => "加密解析失败",
    '9003' => "token解析失败",
    '9004' => "token验证失败",
];
